In [3]:
import pandas as pd

In [22]:
alunos = {
    'nomes': ['Eduardo', 'Heline', 'Cristina', 'Luiz', ],
    'faltas': [2, 1, 0, 3],
    'notas': [9, 8.5, 7, 6]
}

In [23]:
alunos_dataframe = pd.DataFrame(alunos)

In [24]:
alunos_dataframe

      nomes  faltas  notas
0   Eduardo       2    9.0
1    Heline       1    8.5
2  Cristina       0    7.0
3      Luiz       3    6.0

In [26]:
alunos_dataframe.dtypes

nomes      object
faltas      int64
notas     float64
dtype: object

In [27]:
alunos_dataframe.columns

Index(['nomes', 'faltas', 'notas'], dtype='object')

In [37]:
alunos_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nomes   4 non-null      object
 1   faltas  4 non-null      int64
 2   notas   4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [28]:
alunos_dataframe['nomes']

0     Eduardo
1      Heline
2    Cristina
3        Luiz
Name: nomes, dtype: object

In [29]:
alunos_dataframe.describe()

         faltas     notas
count  4.000000  4.000000
mean   1.500000  7.625000
std    1.290994  1.376893
min    0.000000  6.000000
25%    0.750000  6.750000
50%    1.500000  7.750000
75%    2.250000  8.625000
max    3.000000  9.000000

In [32]:
alunos_dataframe.sort_values(by="nomes")

      nomes  faltas  notas
2  Cristina       0    7.0
0   Eduardo       2    9.0
1    Heline       1    8.5
3      Luiz       3    6.0

In [33]:
print(alunos_dataframe.sort_values(by="nomes"))

      nomes  faltas  notas
2  Cristina       0    7.0
0   Eduardo       2    9.0
1    Heline       1    8.5
3      Luiz       3    6.0

In [34]:
alunos_dataframe.loc[3]

nomes     Luiz
faltas       3
notas      6.0
Name: 3, dtype: object

In [35]:
alunos_dataframe[alunos_dataframe['notas'] == 9]

     nomes  faltas  notas
0  Eduardo       2    9.0

In [36]:
print(alunos_dataframe[alunos_dataframe['notas'] == 9])

     nomes  faltas  notas
0  Eduardo       2    9.0